Revit 2018 API
IModelExportContext.OnPolyline Method
 This method is called when a 3D Polyline is being output.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Syntax
C#
RenderNodeAction OnPolyline(
	PolylineNode node
)
Visual Basic
Function OnPolyline ( _
	node As PolylineNode _
) As RenderNodeAction
Visual C++
RenderNodeAction OnPolyline(
	PolylineNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.PolylineNode
 An output node that represents a Polyline.
Return Value
 Return RenderNodeAction.Proceed if you wish to receive tessellated geometry (polyline segments) for this polyline, or otherwise return RenderNodeAction.Skip.
Remarks
 Note that this method is invoked only if the custom exporter was set up to include geometric objects in the output stream. See IncludeGeometricObjects for mode details.
See Also
IModelExportContext Interface
Autodesk.Revit.DB Namespace